## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                  RESOURCE                   |
|--------|---------------------------------------------|
| add    | `aws_route53_record.superset_docs_HTTPS`    |
| update | `aws_cloudfront_distribution.superset_docs` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.superset_docs will be updated in-place
  ~ resource "aws_cloudfront_distribution" "superset_docs" {
      ~ http_version                    = "http2" -> "http2and3"
        id                              = "EEC9BUT3BBF9O"
        tags                            = {
            "CostCentre" = "cds-superset-docs-staging"
            "Terraform"  = "true"
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_route53_record.superset_docs_HTTPS will be created
  + resource "aws_route53_record" "superset_docs_HTTPS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "docs.superset.cdssandbox.xyz"
      + type            = "HTTPS"
      + zone_id         = (sensitive value)

      + alias {
          + evaluate_target_health = false
          + name                   = "d1x1t33bk7tscz.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.superset_docs_errors"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.superset_docs"]

20 tests, 18 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
